https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#min

### Default Integer Index aus Werteliste erstellen

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### DataFrame Ã¼ber NumPy Array mit Datumsliste erstellen

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
#np.random.randn() erstellt ein Array aus Zufallsvariablen

In [7]:
df

                   A         B         C         D
2013-01-01  0.862078  1.754571 -0.549634  0.626582
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398
2013-01-05  2.257986 -0.767776  1.130273  0.847012
2013-01-06  0.036606  0.400605 -0.429306 -0.535583

In [8]:
df.head() #betrachtet obere Zeilen der tabelle

                   A         B         C         D
2013-01-01  0.862078  1.754571 -0.549634  0.626582
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398
2013-01-05  2.257986 -0.767776  1.130273  0.847012

In [9]:
df.tail() #betrachtet untere zeilen der tabelle

                   A         B         C         D
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398
2013-01-05  2.257986 -0.767776  1.130273  0.847012
2013-01-06  0.036606  0.400605 -0.429306 -0.535583

In [10]:
df.index #gibt ausgangszeilen aus

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns #gibt ausgangspalten aus

Index(['A', 'B', 'C', 'D'], dtype='object')

### DataFrame aus Dictionary erstellen

In [12]:
df2 = pd.DataFrame(
{
    "A": 1.0, 
    "B": pd.Timestamp("20130102"), #entspricht pythons datetime
    "C": pd.Series(1, index=list(range(4)), dtype="float32"), #series als Spalte einer Tabelle
    "D": np.array([3]*4, dtype="int32"), #array = einfaches Array
    "E": pd.Categorical(["test", "train", "test", "train"]), #categorical = nimmt feste Anzahl mÃ¶glicher Werte
    "F": "foo",
}
)

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes #ergebnis-frames haben unterschiedliche dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### DataFrame.to_numpy() zur ReprÃ¤sentation der Daten

In [15]:
df.to_numpy()

array([[ 0.86207816,  1.75457129, -0.54963428,  0.62658239],
       [-0.92625981, -0.31463856, -0.32440293, -0.561541  ],
       [ 0.12591356, -0.8535304 , -0.56380522, -1.27842591],
       [-0.08597625, -1.08247567,  0.42832081, -1.32339803],
       [ 2.25798649, -0.76777592,  1.13027298,  0.84701164],
       [ 0.03660608,  0.40060502, -0.42930604, -0.53558346]])

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
#DataFrame ist immmer ohne Zeilen-/Spaltenindizes!!!

### df.describe() fÃ¼r schnelle statistische Zusammenfassung der Daten

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.378391 -0.143874 -0.051426 -0.370892
std    1.083065  1.068040  0.686239  0.924403
min   -0.926260 -1.082476 -0.563805 -1.323398
25%   -0.055331 -0.832092 -0.519552 -1.099205
50%    0.081260 -0.541207 -0.376854 -0.548562
75%    0.678037  0.221794  0.240140  0.336041
max    2.257986  1.754571  1.130273  0.847012

### Daten umstellen (Zeilen mit Spalten tauschen)

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.862078   -0.926260    0.125914   -0.085976    2.257986    0.036606
B    1.754571   -0.314639   -0.853530   -1.082476   -0.767776    0.400605
C   -0.549634   -0.324403   -0.563805    0.428321    1.130273   -0.429306
D    0.626582   -0.561541   -1.278426   -1.323398    0.847012   -0.535583

### Werte sortieren

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426
2013-01-05  2.257986 -0.767776  1.130273  0.847012
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-06  0.036606  0.400605 -0.429306 -0.535583
2013-01-01  0.862078  1.754571 -0.549634  0.626582

### Nur eine Spalte auswÃ¤hlen

In [21]:
df['A']

2013-01-01    0.862078
2013-01-02   -0.926260
2013-01-03    0.125914
2013-01-04   -0.085976
2013-01-05    2.257986
2013-01-06    0.036606
Freq: D, Name: A, dtype: float64

### Slicing

In [22]:
df[0:2] #Zeilen-Slicing

                   A         B         C         D
2013-01-01  0.862078  1.754571 -0.549634  0.626582
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541

In [23]:
df["20130102":"20130104"] #Spalten-Slicing Ã¼ber Indizes-Werte

                   A         B         C         D
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398

### Auswahl nach n. Wert pro Spalte

In [24]:
df.loc[dates[0]] #index gibt Spalte an

A    0.862078
B    1.754571
C   -0.549634
D    0.626582
Name: 2013-01-01 00:00:00, dtype: float64

### Auswahl nach nur bestimmten Spalten

In [25]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.862078  1.754571
2013-01-02 -0.926260 -0.314639
2013-01-03  0.125914 -0.853530
2013-01-04 -0.085976 -1.082476
2013-01-05  2.257986 -0.767776
2013-01-06  0.036606  0.400605

### Auswahl nach bestimmten Indizes in bestimmten Spalten

In [26]:
df.loc["20130102", ['A', 'B']]

A   -0.926260
B   -0.314639
Name: 2013-01-02 00:00:00, dtype: float64

### Ungerundeten Wert aufrufen

In [27]:
df.loc[dates[3], 'A']

-0.0859762519951943

In [28]:
df.at[dates[3], 'A']

-0.0859762519951943

### Position der Ã¼bersprungenen Integers

In [29]:
df.iloc[3]

A   -0.085976
B   -1.082476
C    0.428321
D   -1.323398
Name: 2013-01-04 00:00:00, dtype: float64

### Integer Slices von Zeilen und Spalten

In [30]:
df.iloc[3:5, 0:2] #Zeile 3+4, Spalte 0+1

                   A         B
2013-01-04 -0.085976 -1.082476
2013-01-05  2.257986 -0.767776

### Speziell ausgewÃ¤hlte Integer Slices

In [31]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.926260 -0.324403
2013-01-03  0.125914 -0.563805
2013-01-05  2.257986  1.130273

### Reihenslicing und Spaltenslicing

In [32]:
df.iloc [1:3, :]

                   A         B         C         D
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.754571 -0.549634
2013-01-02 -0.314639 -0.324403
2013-01-03 -0.853530 -0.563805
2013-01-04 -1.082476  0.428321
2013-01-05 -0.767776  1.130273
2013-01-06  0.400605 -0.429306

In [34]:
df.iloc[1, 1]

-0.31463855628272946

In [35]:
df.iat[1, 1]

-0.31463855628272946

### Boolean Indexing

In [36]:
#alle Zeilen und Spalten, in denen B > 0
df[df['B'] > 0]

                   A         B         C         D
2013-01-01  0.862078  1.754571 -0.549634  0.626582
2013-01-06  0.036606  0.400605 -0.429306 -0.535583

In [37]:
#alle Werte auswÃ¤hlen, wo eine allgemeine Boolean-Bedingung zutrifft
df[df > 0]

                   A         B         C         D
2013-01-01  0.862078  1.754571       NaN  0.626582
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.125914       NaN       NaN       NaN
2013-01-04       NaN       NaN  0.428321       NaN
2013-01-05  2.257986       NaN  1.130273  0.847012
2013-01-06  0.036606  0.400605       NaN       NaN

### Werte als Index Ã¼berschreiben und dann abrufen

In [38]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.862078  1.754571 -0.549634  0.626582    one
2013-01-02 -0.926260 -0.314639 -0.324403 -0.561541    one
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426    two
2013-01-04 -0.085976 -1.082476  0.428321 -1.323398  three
2013-01-05  2.257986 -0.767776  1.130273  0.847012   four
2013-01-06  0.036606  0.400605 -0.429306 -0.535583  three

In [39]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.125914 -0.853530 -0.563805 -1.278426   two
2013-01-05  2.257986 -0.767776  1.130273  0.847012  four

### Spalten erstellen

In [40]:
#neue spalte erstellen
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130101', periods=6)) #ziffer 2013... wird automatisch hochgezÃ¤hlt

In [41]:
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
#werte nach beschriftung festsetzen
df.at[dates[0], 'A'] = 0

In [44]:
#werte nach position erstellen
df.iat[0, 1] = 0

In [45]:
#erstellen Ã¼ber numpy array
df.loc[:, 'D'] = np.array([5] * len(df))

In [46]:
#gesamtergebnis der operationen darÃ¼ber:
df

                   A         B         C  D  F
2013-01-01  0.000000  0.000000 -0.549634  5  1
2013-01-02 -0.926260 -0.314639 -0.324403  5  2
2013-01-03  0.125914 -0.853530 -0.563805  5  3
2013-01-04 -0.085976 -1.082476  0.428321  5  4
2013-01-05  2.257986 -0.767776  1.130273  5  5
2013-01-06  0.036606  0.400605 -0.429306  5  6

In [47]:
#where-operation
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D  F
2013-01-01  0.000000  0.000000 -0.549634 -5 -1
2013-01-02 -0.926260 -0.314639 -0.324403 -5 -2
2013-01-03 -0.125914 -0.853530 -0.563805 -5 -3
2013-01-04 -0.085976 -1.082476 -0.428321 -5 -4
2013-01-05 -2.257986 -0.767776 -1.130273 -5 -5
2013-01-06 -0.036606 -0.400605 -0.429306 -5 -6

### Fehlende Daten

In [48]:
#np.nan reprÃ¤sentiert fehlende daten
#reindexing nÃ¶tig, um fehlende daten verarbeiten zu kÃ¶nnen
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0] : dates[1], 'E'] = 1

df1

                   A         B         C  D  F    E
2013-01-01  0.000000  0.000000 -0.549634  5  1  1.0
2013-01-02 -0.926260 -0.314639 -0.324403  5  2  1.0
2013-01-03  0.125914 -0.853530 -0.563805  5  3  NaN
2013-01-04 -0.085976 -1.082476  0.428321  5  4  NaN

### Zeilen mit fehlenden Daten ignorieren

In [49]:
df1.dropna(how='any')

                  A         B         C  D  F    E
2013-01-01  0.00000  0.000000 -0.549634  5  1  1.0
2013-01-02 -0.92626 -0.314639 -0.324403  5  2  1.0

### Fehlende Daten mit bestimmtem Wert auffÃ¼llen

In [50]:
df1.fillna(value=42)

                   A         B         C  D  F     E
2013-01-01  0.000000  0.000000 -0.549634  5  1   1.0
2013-01-02 -0.926260 -0.314639 -0.324403  5  2   1.0
2013-01-03  0.125914 -0.853530 -0.563805  5  3  42.0
2013-01-04 -0.085976 -1.082476  0.428321  5  4  42.0

### Fehlende Daten Ã¼ber Boolean prÃ¼fen

In [51]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Operations

##### Stats: Mittelwert

In [52]:
df.mean() #beschreibende Statistik: Mittelwert jeder Spalte bestimmt

A    0.234712
B   -0.436303
C   -0.051426
D    5.000000
F    3.500000
dtype: float64

In [53]:
df.mean(1) #Mittelwert jeder Zeile bestimmt

2013-01-01    1.090073
2013-01-02    1.086940
2013-01-03    1.341716
2013-01-04    1.651974
2013-01-05    2.524097
2013-01-06    2.201581
Freq: D, dtype: float64

In [55]:
#axis: Subtraktion wird spaltenweise durchgefÃ¼hrt
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [56]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.874086 -1.853530 -1.563805  4.0  2.0
2013-01-04 -3.085976 -4.082476 -2.571679  2.0  1.0
2013-01-05 -2.742014 -5.767776 -3.869727  0.0  0.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [58]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -0.549634   5   1
2013-01-02 -0.926260 -0.314639 -0.874037  10   3
2013-01-03 -0.800346 -1.168169 -1.437842  15   6
2013-01-04 -0.886323 -2.250645 -1.009522  20  10
2013-01-05  1.371664 -3.018421  0.120751  25  15
2013-01-06  1.408270 -2.617816 -0.308555  30  21

In [59]:
df.apply(lambda x: x.max() - x.min())

A    3.184246
B    1.483081
C    1.694078
D    0.000000
F    5.000000
dtype: float64

### Histogramming

In [64]:
s = pd.Series(np.random.randint(0, 7, size=10)) #size gibt anzahl der zeilen an
s

0    4
1    2
2    2
3    1
4    3
5    1
6    0
7    1
8    3
9    0
dtype: int32

In [65]:
s.value_counts() #zÃ¤hlt wie oft in s oben jeder wert vorkommt

1    3
2    2
3    2
0    2
4    1
dtype: int64

##### String Methods

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CAB', 'dog', 'cat' ])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6     cab
7     dog
8     cat
dtype: object

### Daten zusammenfÃ¼gen

##### Verbinden

In [68]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.953363  0.748267 -1.141602  0.441583
1 -0.778894  1.207794  0.778726 -0.601067
2 -1.015045 -0.060606  0.484130  0.459045
3  0.802634 -0.458910  0.471182 -0.029553
4 -0.046362 -0.239678 -0.806461  0.028620
5  0.327087  0.891707 -0.094492  0.901538
6 -0.746418  0.018540  0.957166 -0.834982
7 -1.686689 -0.202195  0.694609  0.083058
8  0.016110 -1.747128 -0.133199  0.881985
9  1.210469  0.029498  0.472246  0.476315

In [69]:
#aufteilen in kleinere einheiten
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.953363  0.748267 -1.141602  0.441583
1 -0.778894  1.207794  0.778726 -0.601067
2 -1.015045 -0.060606  0.484130  0.459045
3  0.802634 -0.458910  0.471182 -0.029553
4 -0.046362 -0.239678 -0.806461  0.028620
5  0.327087  0.891707 -0.094492  0.901538
6 -0.746418  0.018540  0.957166 -0.834982
7 -1.686689 -0.202195  0.694609  0.083058
8  0.016110 -1.747128 -0.133199  0.881985
9  1.210469  0.029498  0.472246  0.476315

### Join

In [73]:
left = pd.DataFrame({"key": ['foo', 'foo'], 'lval':[1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  foo     2

In [74]:
right

   key  rval
0  foo     4
1  foo     5

In [75]:
pd.merge(left, right, on='key') #fÃ¼gt beide einzeltabellen zu einer einzigen zusammen

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [76]:
#weiteres Beispiel
left = pd.DataFrame({"key": ['foo', 'bar'], 'lval':[1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  bar     2

In [77]:
right

   key  rval
0  foo     4
1  bar     5

In [78]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [79]:
#hier weiter mit GROUPING ...